catpet_api/app/controllers/alimentacoes_controller.rb

  def index
    render json: Alimentacao.where(user_id: params[:user_id])
---
SELECT "alimentacaos".* FROM "alimentacaos" WHERE "alimentacaos"."user_id" = 8

  def create
    alimentacao = Alimentacao.new(alimentacao_params.merge(user_id: params[:user_id]))

    if alimentacao.save
---
INSERT INTO "alimentacaos" ("title", "description", "user_id", "created_at", "updated_at") VALUES (NULL, NULL, 8, '2025-12-01 10:18:58.800876', '2025-12-01 10:18:58.800876') RETURNING "id"