catpet_api/app/controllers/consultas_controller.rb

SELECT "consulta".* FROM "consulta" WHERE "consulta"."user_id" = 8
---
  def index
    render json: Consulta.where(user_id: params[:user_id])

INSERT INTO "consulta" ("title", "description", "user_id", "created_at", "updated_at") VALUES ('consula', 'consula', 8, '2025-12-07 15:04:26.000470', '2025-12-07 15:04:26.000470') RETURNING "id"
---
  def create
    consulta = Consulta.new(consulta_params.merge(user_id: params[:user_id]))

    if consulta.save