catpet_api/app/controllers/doctors_controller.rb

  def index
    doctors = Doctor.all
---
SELECT "doctors".* FROM "doctors"

  def create
    doctor = Doctor.new(doctor_params)

    if doctor.save
---
INSERT INTO "doctors" ("name", "specialty", "rating", "phone", "email", "price", "created_at", "updated_at") VALUES ('Dr. João Silva', 'Cardiologia', 5, '11999999999', 'dr.joao@example.com', 300.0, '2025-12-07 16:10:55.940881', '2025-12-07 16:10:55.940881') RETURNING "id"