catpet_api/app/controllers/pets_controller.rb

  def create
    pet = @user.pets.new(pet_params)

    if pet.save
---
INSERT INTO "pets" ("name", "species", "breed", "age", "user_id", "created_at", "updated_at") VALUES ('Buddy', 'cachorro', 'Labrador', 5, 7, '2025-10-31 06:53:56.298746', '2025-10-31 06:53:56.298746') RETURNING "id"