catpet_api/app/controllers/quests_controller.rb

SELECT "quests".* FROM "quests"
---
  def index
    quests = Quest.all

INSERT INTO "quests" ("name", "description", "times", "xp", "created_at", "updated_at") VALUES ('Daily Walk', 'Take your pet for a 30-minute walk.', 3, 20, '2025-12-07 15:21:28.366878', '2025-12-07 15:21:28.366878') RETURNING "id"
---
  def create
    quest = Quest.new(quest_params)

    if quest.save