catpet_api/app/controllers/registrations_controller.rb

  def create
    user = User.create!(user_params)
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ('Ewerton Silva', 'ewerton@example.com', '$2a$12$mwLnk9cxKvLDv3m0RThup.IO6C6G94S7XVtal5.vgPL9wwOPwQlKK', '2025-10-12 21:52:17.890798', '2025-10-12 21:52:17.890798') RETURNING "id"