catpet_api/app/controllers/registros_controller.rb

  def index
    registros = Registro.where(user_id: params[:user_id])

    render json: registros.map { |r|
---
SELECT "registros".* FROM "registros" WHERE "registros"."user_id" = 8

  def create
    registro = Registro.new(
      title: params[:title],
      description: params[:description],
      photo: params[:photos].present? ? params[:photos][0] : nil,
      user_id: params[:user_id]
    )

    if registro.save
---
INSERT INTO "registros" ("title", "description", "user_id", "created_at", "updated_at") VALUES ('asd', 'sads', 8, '2025-12-07 14:43:51.512329', '2025-12-07 14:43:51.512329') RETURNING "id"

  def update
    if @registro.update(registro_params)
---
UPDATE "registros" SET "updated_at" = '2025-12-07 14:44:06.770876' WHERE "registros"."id" = 2