catpet_api/app/controllers/user_task_completeds_controller.rb

    def index
        completeds = UserTaskCompleted
                        .includes(:quest)
                        .where(user_id: params[:user_id])

        render json: completeds.map { |c|
---
SELECT "quests".* FROM "quests" WHERE "quests"."id" = 1

  def create
    completed = UserTaskCompleted.new(
      user_id: params[:user_id],
      quest_id: params[:quest_id]
    )

    if completed.save
---
INSERT INTO "user_task_completeds" ("user_id", "quest_id", "created_at", "updated_at") VALUES (8, 1, '2025-12-07 16:29:46.802116', '2025-12-07 16:29:46.802116') RETURNING "id"